export const OLD_TESTAMENT_BOOKS: string[] = [
  "ኦሪት ዘፍጥረት", "ኦሪት ዘጸአት", "ኦሪት ዘሌዋውያን", "ኦሪት ዘኍልቍ", "ኦሪት ዘዳግም", "መጽሐፈ ኢያሱ ወልደ ነዌ",
  "መጽሐፈ መሣፍንት", "መጽሐፈ ሩት", "መጽሐፈ ሳሙኤል ቀዳማዊ", "መጽሐፈ ሳሙኤል ካል B", "መጽሐፈ ነገሥት ቀዳማዊ",
  "መጽሐፈ ነገሥት ካልዕ", "መጽሐፈ ዜና መዋዕል ቀዳማዊ", "መጽሐፈ ዜና መዋዕል ካልዕ", "መጽሐፈ ዕዝራ", "መጽሐፈ ነህምያ",
  "መጽሐፈ አስቴር", "መጽሐፈ ኢዮብ", "መዝሙረ ዳዊት", "መጽሐፈ ምሳሌ", "መጽሐፈ መክብብ", "መኃልየ መኃልይ ዘሰሎሞን",
  "ትንቢተ ኢሳይያስ", "ትንቢተ ኤርምያስ", "ሰቆቃው ኤርምያስ", "ትንቢተ ሕዝቅኤል", "ትንቢተ ዳንኤል", "ትንቢተ ሆሴዕ",
  "ትንቢተ ኢዮኤል", "ትንቢተ አሞጽ", "ትንቢተ አብድዩ", "ትንቢተ ዮናስ", "ትንቢተ ሚክያስ", "ትንቢተ ናሆም",
  "ትንቢተ ዕንባቆም", "ትንቢተ ሶፎንያስ", "ትንቢተ ሐጌ", "ትንቢተ ዘካርያስ", "ትንቢተ ሚልክያስ"
];

export const NEW_TESTAMENT_BOOKS: string[] = [
  "የማቴዎስ ወንጌል", "የማርቆስ ወንጌል", "የሉቃስ ወንጌል", "የዮሐንስ ወንጌል", "የሐዋርያት ሥራ",
  "ወደ ሮሜ ሰዎች", "1ኛ ወደ ቆሮንቶስ ሰዎች", "2ኛ ወደ ቆሮንቶስ ሰዎች", "ወደ ገላትያ ሰዎች", "ወደ ኤፌሶን ሰዎች",
  "ወደ ፊልጵስዩስ ሰዎች", "ወደ ቆላስይስ ሰዎች", "1ኛ ወደ ተሰሎንቄ ሰዎች", "2ኛ ወደ ተሰሎንቄ ሰዎች", "1ኛ ወደ ጢሞቴዎስ",
  "2ኛ ወደ ጢሞቴዎስ", "ወደ ቲቶ", "ወደ ፊልሞና", "ወደ ዕብራውያን", "የያዕቆብ መልእክት",
  "1ኛ የጴጥሮስ መልእክት", "2ኛ የጴጥሮስ መልእክት", "1ኛ የዮሐንስ መልእክት", "2ኛ የዮሐንስ መልእክት", "3ኛ የዮሐንስ መልእክት",
  "የይሁዳ መልእክት", "የዮሐንስ ራእይ"
];

export const BOOK_CHAPTERS: { [key: string]: number } = {
  "ኦሪት ዘፍጥረት": 50, "ኦሪት ዘጸአት": 40, "ኦሪት ዘሌዋውያን": 27, "ኦሪት ዘኍልቍ": 36, "ኦሪት ዘዳግም": 34,
  "መጽሐፈ ኢያሱ ወልደ ነዌ": 24, "መጽሐፈ መሣፍንት": 21, "መጽሐፈ ሩት": 4, "መጽሐፈ ሳሙኤል ቀዳማዊ": 31,
  "መጽሐፈ ሳሙኤል ካል B": 24, "መጽሐፈ ነገሥት ቀዳማዊ": 22, "መጽሐፈ ነገሥት ካልዕ": 25, "መጽሐፈ ዜና መዋዕል ቀዳማዊ": 29,
  "መጽሐፈ ዜና መዋዕል ካልዕ": 36, "መጽሐፈ ዕዝራ": 10, "መጽሐፈ ነህምያ": 13, "መጽሐፈ አስቴር": 10, "መጽሐፈ ኢዮብ": 42,
  "መዝሙረ ዳዊት": 150, "መጽሐፈ ምሳሌ": 31, "መጽሐፈ መክብብ": 12, "መኃልየ መኃልይ ዘሰሎሞን": 8, "ትንቢተ ኢሳይያስ": 66,
  "ትንቢተ ኤርምያስ": 52, "ሰቆቃው ኤርምያስ": 5, "ትንቢተ ሕዝቅኤል": 48, "ትንቢተ ዳንኤል": 12, "ትንቢተ ሆሴዕ": 14,
  "ትንቢተ ኢዮኤል": 3, "ትንቢተ አሞጽ": 9, "ትንቢተ አብድዩ": 1, "ትንቢተ ዮናስ": 4, "ትንቢተ ሚክያስ": 7,
  "ትንቢተ ናሆም": 3, "ትንቢተ ዕንባቆም": 3, "ትንቢተ ሶፎንያስ": 3, "ትንቢተ ሐጌ": 2, "ትንቢተ ዘካርያስ": 14,
  "ትንቢተ ሚልክያስ": 4,
  "የማቴዎስ ወንጌል": 28, "የማርቆስ ወንጌል": 16, "የሉቃስ ወንጌል": 24, "የዮሐንስ ወንጌል": 21, "የሐዋርያት ሥራ": 28,
  "ወደ ሮሜ ሰዎች": 16, "1ኛ ወደ ቆሮንቶስ ሰዎች": 16, "2ኛ ወደ ቆሮንቶስ ሰዎች": 13, "ወደ ገላትያ ሰዎች": 6,
  "ወደ ኤፌሶን ሰዎች": 6, "ወደ ፊልጵስዩስ ሰዎች": 4, "ወደ ቆላስይስ ሰዎች": 4, "1ኛ ወደ ተሰሎንቄ ሰዎች": 5,
  "2ኛ ወደ ተሰሎንቄ ሰዎች": 3, "1ኛ ወደ ጢሞቴዎስ": 6, "2ኛ ወደ ጢሞቴዎስ": 4, "ወደ ቲቶ": 3, "ወደ ፊልሞና": 1,
  "ወደ ዕብራውያን": 13, "የያዕቆብ መልእክት": 5, "1ኛ የጴጥሮስ መልእክት": 5, "2ኛ የጴጥሮስ መልእክት": 3,
  "1ኛ የዮሐንስ መልእክት": 5, "2ኛ የዮሐንስ መልእክት": 1, "3ኛ የዮሐንስ መልእክት": 1, "የይሁዳ መልእክት": 1, "የዮሐንስ ራእይ": 22
};
